<template>
  <div class="flex justify-center ipad:mt-[70px]">
    <div class="w-[80%] m-auto">
      <h2 class="text-[48px] font-semibold ipad:my-10 pho:my-2">О компании</h2>
      <div class="md:w-[60%] m-auto">
        <p class="font-semibold ipad:my-8">
          Добро пожаловать на сайт Компании Reginox Reef Holding (ООО
          «РеджиноксРиф Холдинг») — единственного и официального представителя
          производителя сантехнической продукции для кухни и ванной комнаты
          Reginox (Нидерланды).
        </p>
        <button @click="close()" class="border-y-4 my-4">
          Читать полностью
        </button>

        <div class="" v-if="closeText">
          <p class="my-8 ipad:leading-8">
            Основной специализацией нашей компании являются розничные и оптовые
            продажи кухонной сантехники по всей России. Мы предлагаем кухонные
            мойки из нержавеющей стали и гранитного композита, смесители для
            кухни, а также оригинальную продукцию от Reginox:
          </p>
          <ul class="list-disc mx-10 sm:leading-9">
            <li class="">умывальники</li>
            <li class="">окрашенныемойки</li>
            <li class="">системы газовых конфорок PITTbyReginox</li>
            <li class="">многофункциональные кухонные комплексы и др.</li>
          </ul>
          <p class="my-10">
            Более 25 лет назад компания RRHolding представила на российском
            рынке кухонные мойки Reginox из нержавеющей стали, приятно удивившие
            покупателей отличным качеством, многообразием моделей и современным
            дизайном. Продукция Reginox входит в постоянный ассортимент ряда
            крупных фабрик-производителей мебели, введена в предложение
            крупнейших продавцов мебельной фурнитуры и комплектующих, и
            представлена вомножестве кухонных салонов по всей России. За годы
            нашей работы мы заключили контракты в сферах:
          </p>
          <ul class="list-disc mx-10 sm:leading-9 pho:leading-7">
            <li>авиастроение</li>
            <li>вагоностроение</li>
            <li>судостроение</li>
            <li>здравоохранение</li>
            <li>предприятия общественного питания</li>
            <li>иные учреждения сферы обслуживания и др.</li>
          </ul>

          <h2 class="text-[32px] font-semibold my-10">наши преимущества</h2>
          <ul class="list-disc my-4 mx-10">
            <li>
              многолетний опыт, профессиональный подход, надежное партнерство и
              отличная репутация на рынке
            </li>
            <li>
              высококачественный европейский товар и гарантия производителя,
              соответствие всем международным и российским стандартам и
              требованиям
            </li>
            <li>
              постоянное наличие на складе Москвы и Санкт-Петербурга
              (официальное представительство ООО «Ревестал»), а также
              возможность изготовления под индивидуальный заказ
            </li>
            <li>
              работа с розничными покупателями, с мелкооптовыми и крупнооптовыми
              заказчиками, сотрудничество с каждым покупателем или
              бизнес-партнеромпо специальной программе и индивидуальной ценовой
              политике
            </li>
            <li>
              широкий ассортимент и различные модификации, позволяющие
              реализоватьпроекты в различных сферах- доставка в любую точку
              России
            </li>
          </ul>
          <p class="">
            Благодаря многолетнему и плодотворному тандему RRHolding и Reginox,
            сегодня мы имеем большое количество бизнес-партнеров, в том числе и
            за пределами РФ, с которыми поддерживаем и развиваем взаимовыгодные
            отношения, приобрели популярность среди потребителей, и сохранили за
            собой статус компании, предлагающей на рынке России продукцию со
            «стальной репутацией». Мы предлагаем лучшее качество от европейского
            завода-производителя (завод расположен в Нидерландах, город Rijssen)
            и пожизненную гарантию на продукцию из нержавеющей стали!
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";

const closeText = ref(false);

function close() {
  return (closeText.value = !closeText.value);
}
</script>

<style scoped></style>
